HITSIC/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTDN_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTDN_GPIO_PIN                                      23U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTDN_GPIO_PIN_MASK                         (1U << 23U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_KEY_BTDN_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTDN_PIN                                           23U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_KEY_BTDN_PIN_MASK                              (1U << 23U)   /*!< PORT pin mask */

/* GPIO_B1_06 (coord C12), BEEP_EN */
/* Routed pin properties */
#define RTEPIN_ALLPIN_BEEP_EN_PERIPHERAL                                   GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_BEEP_EN_SIGNAL                                     gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_BEEP_EN_CHANNEL                                        22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_BEEP_EN_GPIO                                         GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_BEEP_EN_GPIO_PIN                                       22U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_BEEP_EN_GPIO_PIN_MASK                          (1U << 22U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_BEEP_EN_PORT                                         GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_BEEP_EN_PIN                                            22U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_BEEP_EN_PIN_MASK                               (1U << 22U)   /*!< PORT pin mask */

/* GPIO_B1_05 (coord D12), SERVO_EN */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SERVO_EN_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SERVO_EN_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_SERVO_EN_CHANNEL                                       21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_SERVO_EN_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_SERVO_EN_GPIO_PIN                                      21U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_SERVO_EN_GPIO_PIN_MASK                         (1U << 21U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_SERVO_EN_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_SERVO_EN_PIN                                           21U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_SERVO_EN_PIN_MASK                              (1U << 21U)   /*!< PORT pin mask */

/* GPIO_B1_04 (coord E12), KEY_BTSE */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTSE_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTSE_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTSE_CHANNEL                                       20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTSE_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTSE_GPIO_PIN                                      20U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTSE_GPIO_PIN_MASK                         (1U << 20U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_KEY_BTSE_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTSE_PIN                                           20U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_KEY_BTSE_PIN_MASK                              (1U << 20U)   /*!< PORT pin mask */

/* GPIO_B1_02 (coord C11), MOTOR_EN */
/* Routed pin properties */
#define RTEPIN_ALLPIN_MOTOR_EN_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_MOTOR_EN_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_MOTOR_EN_CHANNEL                                       18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_MOTOR_EN_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_MOTOR_EN_GPIO_PIN                                      18U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_MOTOR_EN_GPIO_PIN_MASK                         (1U << 18U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_MOTOR_EN_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_MOTOR_EN_PIN                                           18U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_MOTOR_EN_PIN_MASK                              (1U << 18U)   /*!< PORT pin mask */

/* GPIO_B1_01 (coord B11), KEY_BTME */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTME_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTME_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTME_CHANNEL                                       17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTME_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTME_GPIO_PIN                                      17U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTME_GPIO_PIN_MASK                         (1U << 17U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_KEY_BTME_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTME_PIN                                           17U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_KEY_BTME_PIN_MASK                              (1U << 17U)   /*!< PORT pin mask */

/* GPIO_B0_15 (coord E11), TOF0_XHT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF0_XHT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF0_XHT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF0_XHT_CHANNEL                                       15U   /*!< Signal channel */

