HITSIC/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF0_XHT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF0_XHT_GPIO_PIN                                      15U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF0_XHT_GPIO_PIN_MASK                         (1U << 15U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_TOF0_XHT_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_TOF0_XHT_PIN                                           15U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_TOF0_XHT_PIN_MASK                              (1U << 15U)   /*!< PORT pin mask */

/* GPIO_B0_14 (coord E10), TOF0_INT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF0_INT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF0_INT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF0_INT_CHANNEL                                       14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF0_INT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF0_INT_GPIO_PIN                                      14U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF0_INT_GPIO_PIN_MASK                         (1U << 14U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_TOF0_INT_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_TOF0_INT_PIN                                           14U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_TOF0_INT_PIN_MASK                              (1U << 14U)   /*!< PORT pin mask */

/* GPIO_B0_13 (coord D10), TOF1_XHT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF1_XHT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF1_XHT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF1_XHT_CHANNEL                                       13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF1_XHT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF1_XHT_GPIO_PIN                                      13U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF1_XHT_GPIO_PIN_MASK                         (1U << 13U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_TOF1_XHT_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_TOF1_XHT_PIN                                           13U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_TOF1_XHT_PIN_MASK                              (1U << 13U)   /*!< PORT pin mask */

/* GPIO_B0_12 (coord C10), TOF1_INT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF1_INT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF1_INT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF1_INT_CHANNEL                                       12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF1_INT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF1_INT_GPIO_PIN                                      12U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF1_INT_GPIO_PIN_MASK                         (1U << 12U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_TOF1_INT_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_TOF1_INT_PIN                                           12U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_TOF1_INT_PIN_MASK                              (1U << 12U)   /*!< PORT pin mask */

/* GPIO_B0_11 (coord A10), PWM2_B2 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_B2_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_B2_SIGNAL                                           B   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_B2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_B0_10 (coord D9), PWM2_A2 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_A2_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_A2_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_A2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_B0_09 (coord C9), PWM2_B1 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_B1_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_B1_SIGNAL                                           B   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_B1_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_B0_07 (coord A9), PWM2_B0 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_B0_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_B0_SIGNAL                                           B   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_B0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_B0_06 (coord A8), PWM2_A0 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_A0_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_A0_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_A0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_B0_05 (coord B8), I2C2_SDA */
/* Routed pin properties */
#define RTEPIN_ALLPIN_I2C2_SDA_PERIPHERAL                                 LPI2C2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_I2C2_SDA_SIGNAL                                        SDA   /*!< Signal name */

/* GPIO_B0_04 (coord C8), I2C2_SCL */
/* Routed pin properties */
#define RTEPIN_ALLPIN_I2C2_SCL_PERIPHERAL                                 LPI2C2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_I2C2_SCL_SIGNAL                                        SCL   /*!< Signal name */

/* GPIO_B0_03 (coord D8), SPI4_SCK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SPI4_SCK_PERIPHERAL                                 LPSPI4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SPI4_SCK_SIGNAL                                        SCK   /*!< Signal name */

/* GPIO_B0_02 (coord E8), SPI4_SDO */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SPI4_SDO_PERIPHERAL                                 LPSPI4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SPI4_SDO_SIGNAL                                        SDO   /*!< Signal name */

/* GPIO_B0_01 (coord E7), DISP_BKL */
/* Routed pin properties */
#define RTEPIN_ALLPIN_DISP_BKL_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_DISP_BKL_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_DISP_BKL_CHANNEL                                        1U   /*!< Signal channel */

