HITSIC/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_DISP_BKL_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_BKL_GPIO_PIN                                       1U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_DISP_BKL_GPIO_PIN_MASK                          (1U << 1U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_DISP_BKL_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_BKL_PIN                                            1U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_DISP_BKL_PIN_MASK                               (1U << 1U)   /*!< PORT pin mask */

/* GPIO_B0_00 (coord D7), DISP_D_C */
/* Routed pin properties */
#define RTEPIN_ALLPIN_DISP_D_C_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_DISP_D_C_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_DISP_D_C_CHANNEL                                        0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_DISP_D_C_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_D_C_GPIO_PIN                                       0U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_DISP_D_C_GPIO_PIN_MASK                          (1U << 0U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_DISP_D_C_PORT                                        GPIO2   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_D_C_PIN                                            0U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_DISP_D_C_PIN_MASK                               (1U << 0U)   /*!< PORT pin mask */

/* GPIO_B1_12 (coord D13), UART5_TX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART5_TX_PERIPHERAL                                LPUART5   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART5_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_B1_13 (coord D14), UART5_RX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART5_RX_PERIPHERAL                                LPUART5   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART5_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_B1_15 (coord B14), PWM4_A3 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM4_A3_PERIPHERAL                                    PWM4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM4_A3_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM4_A3_CHANNEL                                         3U   /*!< Signal channel */

/* GPIO_B1_14 (coord C14), PWM4_B3 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM4_A2_PERIPHERAL                                    PWM4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM4_A2_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM4_A2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_EMC_41 (coord C7), DISP_RST */
/* Routed pin properties */
#define RTEPIN_ALLPIN_DISP_RST_PERIPHERAL                                  GPIO3   /*!< Peripheral name */
#define RTEPIN_ALLPIN_DISP_RST_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_DISP_RST_CHANNEL                                       27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_DISP_RST_GPIO                                        GPIO3   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_RST_GPIO_PIN                                      27U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_DISP_RST_GPIO_PIN_MASK                         (1U << 27U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_DISP_RST_PORT                                        GPIO3   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_RST_PIN                                           27U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_DISP_RST_PIN_MASK                              (1U << 27U)   /*!< PORT pin mask */

/* GPIO_SD_B0_00 (coord J4), SDHC_CMD */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_CMD_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_CMD_SIGNAL                                  usdhc_cmd   /*!< Signal name */

/* GPIO_SD_B0_01 (coord J3), SDHC_CLK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_CLK_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_CLK_SIGNAL                                  usdhc_clk   /*!< Signal name */

/* GPIO_SD_B0_02 (coord J1), SDHC_D0 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_D0_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_D0_SIGNAL                                  usdhc_data   /*!< Signal name */
#define RTEPIN_ALLPIN_SDHC_D0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_SD_B0_03 (coord K1), SDHC_D1 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_D1_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_D1_SIGNAL                                  usdhc_data   /*!< Signal name */
#define RTEPIN_ALLPIN_SDHC_D1_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_SD_B0_04 (coord H2), SDHC_D2 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_D2_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_D2_SIGNAL                                  usdhc_data   /*!< Signal name */
#define RTEPIN_ALLPIN_SDHC_D2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_SD_B0_05 (coord J2), SDHC_D3 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_D3_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_D3_SIGNAL                                  usdhc_data   /*!< Signal name */
#define RTEPIN_ALLPIN_SDHC_D3_CHANNEL                                         3U   /*!< Signal channel */

