HITSIC/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* GPIO_SD_B1_00 (coord L5), UART4_TX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART4_TX_PERIPHERAL                                LPUART4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART4_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_SD_B1_01 (coord M5), UART4_RX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART4_RX_PERIPHERAL                                LPUART4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART4_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_SD_B1_02 (coord M3), TCS_INT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TCS_INT_PERIPHERAL                                   GPIO3   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TCS_INT_SIGNAL                                     gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TCS_INT_CHANNEL                                         2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TCS_INT_GPIO                                         GPIO3   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TCS_INT_GPIO_PIN                                        2U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TCS_INT_GPIO_PIN_MASK                           (1U << 2U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_TCS_INT_PORT                                         GPIO3   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_TCS_INT_PIN                                             2U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_TCS_INT_PIN_MASK                                (1U << 2U)   /*!< PORT pin mask */

/* GPIO_SD_B1_03 (coord M4), IMU_INT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_IMU_INT_PERIPHERAL                                   GPIO3   /*!< Peripheral name */
#define RTEPIN_ALLPIN_IMU_INT_SIGNAL                                     gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_IMU_INT_CHANNEL                                         3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_IMU_INT_GPIO                                         GPIO3   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_IMU_INT_GPIO_PIN                                        3U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_IMU_INT_GPIO_PIN_MASK                           (1U << 3U)   /*!< GPIO pin mask */
#define RTEPIN_ALLPIN_IMU_INT_PORT                                         GPIO3   /*!< PORT peripheral base pointer */
#define RTEPIN_ALLPIN_IMU_INT_PIN                                             3U   /*!< PORT pin number */
#define RTEPIN_ALLPIN_IMU_INT_PIN_MASK                                (1U << 3U)   /*!< PORT pin mask */

/* GPIO_SD_B1_04 (coord P2), I2C1_SCL */
/* Routed pin properties */
#define RTEPIN_ALLPIN_I2C1_SCL_PERIPHERAL                                 LPI2C1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_I2C1_SCL_SIGNAL                                        SCL   /*!< Signal name */

/* GPIO_SD_B1_05 (coord N3), I2C1_SDA */
/* Routed pin properties */
#define RTEPIN_ALLPIN_I2C1_SDA_PERIPHERAL                                 LPI2C1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_I2C1_SDA_SIGNAL                                        SDA   /*!< Signal name */

/* GPIO_AD_B1_15 (coord J14), CAM_D2 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D2_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D2_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D2_CHANNEL                                          2U   /*!< Signal channel */

/* GPIO_AD_B1_14 (coord G12), CAM_D3 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D3_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D3_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D3_CHANNEL                                          3U   /*!< Signal channel */

/* GPIO_AD_B1_13 (coord H11), CAM_D4 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D4_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D4_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D4_CHANNEL                                          4U   /*!< Signal channel */

/* GPIO_AD_B1_12 (coord H12), CAM_D5 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D5_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D5_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D5_CHANNEL                                          5U   /*!< Signal channel */

/* GPIO_AD_B1_11 (coord J13), CAM_D6 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D6_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D6_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D6_CHANNEL                                          6U   /*!< Signal channel */

/* GPIO_AD_B1_10 (coord L13), CAM_D7 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D7_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D7_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D7_CHANNEL                                          7U   /*!< Signal channel */

/* GPIO_AD_B1_09 (coord M13), CAM_D8 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D8_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D8_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D8_CHANNEL                                          8U   /*!< Signal channel */

/* GPIO_AD_B1_08 (coord H13), CAM_D9 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_D9_PERIPHERAL                                      CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_D9_SIGNAL                                     csi_data   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_D9_CHANNEL                                          9U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10), CAM_HREF */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_HREF_PERIPHERAL                                    CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_HREF_SIGNAL                                  csi_hsync   /*!< Signal name */

/* GPIO_AD_B1_06 (coord J12), CAM_VSNC */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_VSNC_PERIPHERAL                                    CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_VSNC_SIGNAL                                  csi_vsync   /*!< Signal name */

